In [ ]:
'''
Create a Series from a list of integers representing daily temperatures (in Celsius) over a week. 
Assign index labels as day of the week. 
a. Find and print the average (mean) temperature for the week. 
b. Identify and print the maximum and minimum temperatures and their respective days. 
c. Display the temperatures greater than a specific value. 
d. Convert all temperatures to Fahrenheit. 
e. Print the days had temperatures above the average. 
'''
# Week 4, Code 1
# Nityant Agarwal, CC, 240953418

In [1]:
import pandas as pd

In [16]:
l=[]
for i in range(7):
    l.append(int(input("Enter temp:")))
idx=['monday','tuesday','wednesday','thursday','friday','saturday','sunday']
print(l)
data = pd.Series(l,index=idx,name='Temperature')
data

Enter temp:1
Enter temp:2
Enter temp:3
Enter temp:4
Enter temp:5
Enter temp:6
Enter temp:7
[1, 2, 3, 4, 5, 6, 7]

monday       1
tuesday      2
wednesday    3
thursday     4
friday       5
saturday     6
sunday       7
Name: Temperature, dtype: int64

In [27]:
print("Mean:",data.mean())
print("Max:",data.max(),data[data == data.max()].index[0])
print("Min:",data.min(),data[data == data.min()].index[0])

Mean: 4.0
Max: 7 sunday
Min: 1 monday

In [31]:
print("Temp greater than 5:\n",data.loc[lambda d: d>5])

Temp greater than 5:
 saturday    6
sunday      7
Name: Temperature, dtype: int64

In [34]:
fs = (9/5) * data + 32
print(fs)

monday       33.8
tuesday      35.6
wednesday    37.4
thursday     39.2
friday       41.0
saturday     42.8
sunday       44.6
Name: Temperature, dtype: float64

In [37]:
print("Temp greater than avg:\n",data.loc[lambda d: d>data.mean()])

Temp greater than avg:
 friday      5
saturday    6
sunday      7
Name: Temperature, dtype: int64

In [ ]:
'''
Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3. 
a. Create a new column with total marks 
b. Find the lowest marks in Marks1 
c. Find the Highest marks in Marks2 
d. Find the average marks in Marks3 
e. Find student name with highest average 
f. Find how many students failed in Marks2 (<40)
'''
# Week 4, Code 2
# Nityant Agarwal, CC, 240953418

In [38]:
dat = {
    'Roll Number': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Name': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'],
    'Gender': ['F', 'M', 'M', 'M', 'F', 'M', 'F', 'M', 'F', 'M'],
    'Marks1': [85, 78, 92, 88, 90, 76, 84, 77, 93, 85],
    'Marks2': [89, 75, 91, 85, 92, 79, 86, 80, 94, 82],
    'Marks3': [88, 79, 90, 87, 91, 80, 85, 82, 92, 84]
}
df = pd.DataFrame(dat)
df

   Roll Number Name Gender  Marks1  Marks2  Marks3
0            1    A      F      85      89      88
1            2    B      M      78      75      79
2            3    C      M      92      91      90
3            4    D      M      88      85      87
4            5    E      F      90      92      91
5            6    F      M      76      79      80
6            7    G      F      84      86      85
7            8    H      M      77      80      82
8            9    I      F      93      94      92
9           10    J      M      85      82      84

In [39]:
df['Total'] = df['Marks1'] + df['Marks2'] + df['Marks3']
df

   Roll Number Name Gender  Marks1  Marks2  Marks3  Total
0            1    A      F      85      89      88    262
1            2    B      M      78      75      79    232
2            3    C      M      92      91      90    273
3            4    D      M      88      85      87    260
4            5    E      F      90      92      91    273
5            6    F      M      76      79      80    235
6            7    G      F      84      86      85    255
7            8    H      M      77      80      82    239
8            9    I      F      93      94      92    279
9           10    J      M      85      82      84    251

In [40]:
print("Lowest Marks in Marks1:",df.Marks1.min())
print("Highest Marks in Marks2:",df.Marks2.max())
print("Avg Marks in Marks3:",df.Marks3.mean())
print("Student with Highest Average:\n\n",df.Name.loc[df.Total == df.Total.max()])

Lowest Marks in Marks1: 76
Highest Marks in Marks2: 94
Avg Marks in Marks3: 85.8
Student with Highest Average:

 8    I
Name: Name, dtype: object

In [41]:
print("No. of students who failed in Marks2:",len(df.loc[df.Marks2 < 40]))

No. of students who failed in Marks2: 0